fp-poem.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-12 Tue 17:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Functional Programming for no Rhyme or Reason</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Venkatesh Choppella">
<link rel="stylesheet" type="text/css" href="./style/css/main.css" />
<link href='http://fonts.googleapis.com/css?family=Gloria+Hallelujah' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Functional Programming for no Rhyme or Reason</h1>
<p>
Venkatesh Choppella: 14th May 2019 (tweaked 28th December 2019)
</p>
<p class="verse">
-----------------------&#x2013;&#x2014;<br>
<br>
<code>=====</code><br>
Prelude<br>
<code>=====</code><br>
<br>
Coming to IIIT<br>
this Monsoon season,<br>
Functional Programming<br>
for no Rhyme or Reason.<br>
<br>
The Dean might be worried,<br>
that the syllabus lies buried,<br>
in verse,<br>
that is necessarily terse.<br>
<br>
But, for students in class,<br>
that are bored or sleepy,<br>
or think functional programming<br>
is crazy and creepy,<br>
I made up this jingle<br>
hoping it'll tingle<br>
their curiosity<br>
and coding velocity.<br>
<br>
Not to mention, the faculty,<br>
and curriculum designers, who are wary.<br>
What is functional programming?<br>
And why is it so scary?<br>
I'd rather teach Python or C!<br>
Can't have programming<br>
turn into algebra, you see!<br>
<br>
<code>===========================================</code><br>
Functional Programming for no Rhyme or Reason<br>
<code>===========================================</code><br>
<br>
Expressions have Meaning.<br>
The Meaning is Contextual.<br>
<br>
Programs are Expressions,<br>
Expressions are reducible.<br>
In the crucible of the Interpreter,<br>
the Meaning is deducible.<br>
<br>
Syntax is superficial.<br>
Pick one<br>
that's easy 'n sensible.<br>
While you're at it,<br>
it may, for good measure,<br>
be extensible.<br>
<br>
Values are what you have,<br>
when Expressions are normalizable.<br>
Identifiable and immutable.<br>
Plain and irreducible,<br>
Their existence, irrefutable.<br>
<br>
Semantics is simplificational,<br>
compositional and substitutional.<br>
Depending on what you like,<br>
axiomatic, operational or denotational.<br>
<br>
Bindings are persistent,<br>
and lexical.<br>
Those recursive? Circular,<br>
and paradoxical.<br>
<br>
For, circularity and self-application,<br>
you conclude, after  some meditation,<br>
are at the heart of<br>
Recursive Functions that are Nameless.<br>
and except when baseless (or tasteless),<br>
are begotten, you realise somewhat later<br>
from  Y, the mysterious<br>
Fixed Point combinator.<br>
<br>
Referential transparency,<br>
is not about efficiency.<br>
Young Man!<br>
'Tis a Call to Reason!<br>
Unlike Assignment,<br>
which is forbidden,<br>
and tantamount to treason!<br>
<br>
Still, if Effects is what want you might,<br>
Try this thing called Monadic.<br>
I'm told they're  tricky to get right,<br>
it's best when they are sporadic.<br>
<br>
Functions are values,<br>
applicable, and higher-order.<br>
It's what let's you write<br>
programs that are shorter.<br>
<br>
Functions have Types.<br>
Types are polymorphic.<br>
And isomorphic,<br>
to propositions,<br>
that are logical.<br>
Programs are like proofs,<br>
of theorems  mathematical.<br>
<br>
The moral of this allegory:<br>
Lambda is a Category,<br>
that is closed and Cartesian.<br>
If you don't believe me,<br>
check with a logician,<br>
or a type theoretician.<br>
<br>
<br>
Iteration is Recursion.<br>
Recursion in tail position.<br>
Recursion is Iteration,<br>
just pass the Continuation!<br>
<br>
Be warned! In calling with<br>
the current continuation,<br>
exercise considerable caution,<br>
lest there is confusion,<br>
or a catastrophic situation!<br>
<br>
An Object is a Closure.<br>
(I learned this from a Hoosier.)<br>
Formals, body and  bindings of<br>
free variables that are mutable.<br>
Methods are functions over Self,<br>
in a position that's suitable.<br>
<br>
Data is algebraic, and inductive.<br>
Processes, co-algebraic, and co-inductive.<br>
Now, just in case,<br>
you find  this<br>
so charming and seductive,<br>
there's also reasoning<br>
that's abductive and deductive.<br>
<br>
Logic is Magic.<br>
Magic is Logic.<br>
Ask Smullyan, who did both,<br>
besides Puzzles and Music.<br>
<br>
<br>
Application is Evaluation.<br>
Abstraction is Implication.<br>
Value the destination,<br>
by most estimation.<br>
<br>
Alpha is permutable.<br>
Beta, Eta, the ritual.<br>
Lambda, the Ultimate.<br>
and Omega, the perpetual.<br>
<br>
``You know its value,<br>
but do you know its cost?''<br>
Laments the Garbage Collector,<br>
(the Solitary Sweeper?)<br>
and borrows from Frost:<br>
The lists are lovely, long and deep,<br>
But I have promised to mark the Heap,<br>
And bytes to go before I sweep.<br>
And bytes to go before I sweep.<br>
<br>
<br>
Ah, a whole class in verse!<br>
Now, isn't that perverse?<br>
But,  what is a program,<br>
if not a poem?<br>
At least, this is what<br>
I wish to show 'em.<br>
<br>
<br>
I could go on<br>
and on,<br>
waxing along,<br>
right or wrong.<br>
But now it's time<br>
to close this song.<br>
A functional program<br>
would never be so long.<br>
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Venkatesh Choppella</p>
<p class="date">Created: 2024-03-12 Tue 17:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
